package com.goods.www.datasource

import com.goods.www.R
import com.goods.www.domain.model.ShopItem

val shopItems = listOf(
    ShopItem(
        "다이소",
        R.drawable.daiso,
        "한국의 생활용품 할인점. 1992년 설립하여 1997년 '아스코이븐프라자'로 1호점을 내면서 본격적인 사업을 시작하였으며, 한국의 아성산업이 2001년 일본에서 지분투자를 받기 시작하면서 아성다이소로 사명을 바꾸었다. 2020년 기준 연간 매출만 2조 4천억원(영업이익 1700여억원)이 넘고 한국 매장만 1300호점을 돌파하는 등 확실히 이 분야에선 국내 선두를 달리고 있다."
    ),
    ShopItem(
        "노브랜드",
        R.drawable.nobrand,
        "2015년 4월부터 이마트에서 전개하고 있는 자체 브랜드. No Brand라는 명칭은 캐나다 Loblaw Companies Limited의 \"No Name\" PB 브랜드에서 영향을 받은 것으로 보인다. 상단에 있는 내용인 「브랜드가 아니다. 소비자다.」 및 「당신이 스마트 컨슈머가 되는 길」은 No Brand 브랜드 전체의 캐치프레이즈며, 로고에 나오는 새는 종달새로 지저귀면 좋은 소식을 가져 온다는 뜻으로 새겨놓았다고 한다.\n" +
                "\n" +
                "2015년 8월 기준 약 150여개의 상품이 해당 브랜드로 제공되고 있다. 브랜드 가치에 의해 매겨지는 부가가격을 줄이고 싼 값에 일정 수준의 상품을 대량으로 공급한다는 취지를 가지고 있다. 이쯤되면 이마트의 대표 아닌 브랜드... 가공식품부터 전자제품까지 취급 범위가 상당히 넓은 편.\n" +
                "\n" +
                "다만 이마트가 2019년 8월부터 새로 런칭한 '에브리데이 국민가격'이 기존 노브랜드의 컨셉을 완전히 대체하고 있기에, 2020년 기준으로는 이마트 자체 저가 브랜드의 하나로 보는 게 올바를 것이다."
    ),
    ShopItem(
        "이마트",
        R.drawable.emart,
        "신세계그룹 계열 할인점 체인업체로, 이마트라는 명칭은 'Everyday low price MART'의 약자다. 아시아 최초의 순수 자본 할인점으로 문을 연, 쉽게 말해 오늘날 국내 대형 할인점의 전형을 보여주고 있는 전국구 할인점이다.\n" +
                "\n" +
                "1호점은 창동점이고 본사는 성수점에 위치해 있다. 매장은 전국적으로 있으며, 대도시 시장이 포화된 후인 지금은 인구가 적은 도시를 노리고 있다.\n" +
                "\n" +
                "원래 2008년까지 본사는 응암동의 은평점이었으나, 본점의 기능을 담당하는 7층, 8층을 스포츠 매장 및 문화 공간으로 개장하고 본점은 성수점으로 옮겼다, 이는 아마도 전국 매출 1위 매장인 은평점에 남은 공간을 매장으로 돌리는 편이 더 이익이 크다는 판단에 의한 것으로 보인다(전국매출 1위발언은 이마트 트위터로 확인됨). 성수점에 지은 본사는 사무실 전용 건물을 따로 세웠다.\n" +
                "\n" +
                "인터넷 몰로는 이마트몰과 트레이더스몰, 신세계TV쇼핑(온라인몰), 하우디 등을 운영하다가 SSG.COM으로 통합되었다."
    ),
    ShopItem(
        "코스트코",
        R.drawable.costco,
        "코스트코 홀세일 코퍼레이션(Costco Wholesale Corporation)은 미국의 창고형 대형 할인마트이다. 코스트코가 아마존보다 저렴한 이유. 코스트코의 비즈니스 모델을 설명하고 있다.\n" +
                "\n" +
                "2021년 포춘에서 선정한 전세계 500대 기업 중 27위, 2021년 포춘에서 선정한 미국의 500대 기업 중 12위의 기업이다.\n" +
                "\n" +
                "전 세계 유통업계 1등인 월마트 다음으로 잘 나가는 소매상. 현재 한국에서 영업하는 외국계 할인마트 중 유일하게 잘 나가며 창고형 마트 브랜드 매출 1위 기업이다.\n" +
                "\n" +
                "전 세계 796개의 매장을 운영 중이며, 2020년 회계연도 기준 전 세계 매출이 약 192조 원이다. 한국 법인 코스트코 코리아는 16개의 매장을 운영 중이다. 코스트코 코리아 측의 매출은 2019 회계연도(2019년 9월 1일~2020년 8월 31일)에 4조 5229억 원을 기록하였다. 전년도 대비 8.5% 성장한 수치이다.\n" +
                "\n" +
                "서북부 워싱턴 주에서 시작하여 서부 지방을 중심으로 강세를 보이고 있다. 본사는 시애틀 남동쪽에 있는 워싱턴 주 이사콰에 있다. 현재 한국, 미국, 대만, 영국, 프랑스, 스페인, 캐나다, 호주, 멕시코, 일본, 아이슬란드, 중국에서 영업하고 있다.\n" +
                "\n" +
                "2019년 8월 27일, 중국 상해에 첫 중국 매장이 개점했다. 주차하는 데 3시간, 계산하는 데에 1시간 이상이 소요되는 등 극심한 혼잡으로 4시간만에 영업을 조기 종료했다.\n" +
                "\n" +
                "2021년부터는 뉴질랜드에도 법인을 열고 영업을 시작한다. 첫 지점은 오클랜드에 있는 웨스트게이트(Westgate) 지역에 개장 예정이다.\n" +
                "\n" +
                "한국에 있는 외국 점포 중 이케아와 함께 가장 현지화가 덜 된 매장으로, 매장에 들어가보면 미국 매장과 거의 다를 게 없을 정도로 똑같이 생겼다. 차이점이라면 미국 매장은 대다수가 단층이고 엘리베이터, 무빙워크가 없는 반면 한국은 대부분의 매장이 복층에 엘리베이터, 무빙워크가 있다는 것 정도.\n" +
                "\n" +
                "사실상 한국에서 주한미국대사관과 주 부산 미국 총영사관, 주한미군 기지, 미국계 외국인학교를 제외하면 미국 현지의 느낌을 가장 많이 풍기는 장소 중 하나가 바로 코스트코다. 매장 화장실 근처에 타 지역 및 세계 각국의 코스트코의 매장 사진을 전시해 놓기도 하는데, 보다 보면 해당 나라에서 쓰는 글자가 있거나 어느 나라, 어느 지역 매장이라고 알려주지 않는 한 헷갈릴 정도로 비슷하다."
    )
)